CSI API ETABS v1
cPropFrame.SetPrecastI Method
 Initializes a precast concrete I girder frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPrecastI(
	string Name,
	string MatProp,
	ref double[] b,
	ref double[] d,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetPrecastI (
	Name As String,
	MatProp As String,
	ByRef b As Double(),
	ByRef d As Double(),
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim b As Double()
Dim d As Double()
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetPrecastI(Name,
	MatProp, b, d, Color, Notes, GUID)
int SetPrecastI(
	String^ Name,
	String^ MatProp,
	array<double>^% b,
	array<double>^% d,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetPrecastI :
        Name : string *
        MatProp : string *
        b : float[] byref *
        d : float[] byref *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
The name of an existing or new frame section property. If this is an existing property, that property is modified; otherwise, a new property is added.
MatProp
Type: System.String
The name of the material property for the section.
b
Type: System.Double[]
 This is an array, dimensioned to 3, containing the horizontal section dimensions. [L] b(0) = B1 (> 0) b(1) = B2 (> 0) b(2) = B3 (> 0) b(3) = B4 (>= 0) Section dimensions B1 through B4 are defined on the precast concrete I girder definition form.
d
Type: System.Double[]
 This is an array, dimensioned to 5, containing the vertical section dimensions. [L] d(0) = D1 (> 0) d(1) = D2 (> 0) d(2) = D3 (> 0) d(3) = D4 (>= 0) d(4) = D5 (> 0) d(5) = D6 (>= 0) Section dimensions D1 through D6 are defined on the precast concrete I girder definition form.
Color (Optional)
Type: System.Int32
The display color assigned to the section. If Color is specified as -1, the program will automatically assign a color.
Notes (Optional)
Type: System.String
 The notes, if any, assigned to the section.
GUID (Optional)
Type: System.String
 The GUID (global unique identifier), if any, assigned to the section. If this item is input as Default, then the program assigns a GUID to the section.
Return Value
Type: Int32
 returns zero if the section property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim FileName As String
   Dim MatProp As String
   Dim bb() As Double
   Dim dd() As Double
   Dim Color As Integer
   Dim Notes As String
   Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ReDim bb(3)
       ReDim dd(5)
       bb(0) = 12
       bb(1) = 16
       bb(2) = 6
       bb(3) = 0.5
       dd(0) = 28
       dd(1) = 4
       dd(2) = 1.5
       dd(3) = 1
       dd(4) = 2
       dd(5) = 5
       ret = SapModel.PropFrame.SetPrecastI("PC1", "4000Psi", bb, dd)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace